perf_output/after/memcached-1.5.20/16/memcached-1.5.20_workloadf_16_after_run.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:memcached-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by com.google.inject.internal.cglib.core.$ReflectUtils$1 (file:/usr/share/maven/lib/guice.jar) to method java.lang.ClassLoader.defineClass(java.lang.String,byte[],int,int,java.security.ProtectionDomain)
WARNING: Please consider reporting this to the maintainers of com.google.inject.internal.cglib.core.$ReflectUtils$1
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
java -cp /proj/proxyweb-PG0/adona/YCSB/memcached/conf:/proj/proxyweb-PG0/adona/YCSB/memcached/target/memcached-binding-0.18.0-SNAPSHOT.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/log4j/log4j/1.2.17/log4j-1.2.17.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.13/jackson-mapper-asl-1.9.13.jar:/root/.m2/repository/net/spy/spymemcached/2.11.4/spymemcached-2.11.4.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/proj/proxyweb-PG0/adona/YCSB/core/target/core-0.18.0-SNAPSHOT.jar site.ycsb.Client -db site.ycsb.db.MemcachedClient -threads 16 -s -P workloads/workloadf -p memcached.hosts=localhost:11211 -t
Command line: -db site.ycsb.db.MemcachedClient -threads 16 -s -P workloads/workloadf -p memcached.hosts=localhost:11211 -t
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.
Starting test.
2021-08-11 17:42:14:187 0 sec: 0 operations; est completion in 0 second 
2021-08-11 17:42:14.306 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:42:14.306 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:42:14.306 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
[...]
2021-08-11 17:42:14.308 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:42:14.307 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:42:14.309 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:42:14.310 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2021-08-11 17:42:14.311 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:42:14.311 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:42:14.312 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:42:14.313 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:42:14.313 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:42:14.314 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:42:14.315 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:42:14.315 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:42:14.520 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:42:14.520 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:42:14.524 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:42:14.526 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:42:14.527 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:42:14.530 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:42:14.532 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:42:14.533 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:42:14.532 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:42:14.535 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:42:14.537 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:42:14.539 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:42:14.541 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:42:14.542 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:42:14.544 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:42:14.545 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:42:14:546 0 sec: 1000 operations; 2785.52 current ops/sec; [READ: Count=1000, Max=41567, Min=402, Avg=1576.58, 90=2059, 99=39999, 99.9=41535, 99.99=41567] [READ-MODIFY-WRITE: Count=527, Max=127359, Min=883, Avg=4727.49, 90=4563, 99=125951, 99.9=127167, 99.99=127359] [CLEANUP: Count=16, Max=5923, Min=1097, Avg=2810.5, 90=4627, 99=5923, 99.9=5923, 99.99=5923] [UPDATE: Count=527, Max=68415, Min=412, Avg=2813.51, 90=1838, 99=66943, 99.9=68351, 99.99=68415] 
[OVERALL], RunTime(ms), 359
[OVERALL], Throughput(ops/sec), 2785.515320334262
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 1000
[READ], AverageLatency(us), 1576.584
[READ], MinLatency(us), 402
[READ], MaxLatency(us), 41567
[READ], 95thPercentileLatency(us), 3359
[READ], 99thPercentileLatency(us), 39999
[READ], Return=OK, 1000
[READ-MODIFY-WRITE], Operations, 527
[READ-MODIFY-WRITE], AverageLatency(us), 4727.485768500948
[READ-MODIFY-WRITE], MinLatency(us), 883
[READ-MODIFY-WRITE], MaxLatency(us), 127359
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 7287
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 125951
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 2810.5
[CLEANUP], MinLatency(us), 1097
[CLEANUP], MaxLatency(us), 5923
[CLEANUP], 95thPercentileLatency(us), 5127
[CLEANUP], 99thPercentileLatency(us), 5923
[UPDATE], Operations, 527
[UPDATE], AverageLatency(us), 2813.5085388994307
[UPDATE], MinLatency(us), 412
[UPDATE], MaxLatency(us), 68415
[UPDATE], 95thPercentileLatency(us), 3551
[UPDATE], 99thPercentileLatency(us), 66943
[UPDATE], Return=OK, 527

 Performance counter stats for 'system wide':

       66046214450      cycles                                                        (66.66%)
       12355841308      branches                                                      (66.66%)
         457735392      branch-misses             #    3.70% of all branches          (66.66%)
       12329087851      branch-loads                                                  (66.66%)
         455664455      branch-load-misses                                            (66.68%)
         662154311      L1-icache-load-misses                                         (66.69%)

      12.239307232 seconds time elapsed